# Dhanalakshmi_Python_Graded Microproject

### TERROR.CSV

In [1]:
import os
import pandas as pd

In [3]:
os.chdir("C:\\Users\Parth\Desktop\Python MIT\Python - Graded Microproject")

In [88]:
df=pd.read_csv("terror_gtd.csv",encoding="latin-1")

In [59]:
df.head(10) #just displaying the data

,eventid,iyear,imonth,iday,country_txt,region_txt,provstate,city,location,summary,success,suicide,nkill,nwound
0,1.970000e+11,1970,0,0,Dominican Republic,Central America & Caribbean,NaN,Santo Domingo,NaN,NaN,1,0,1.0,0.0
1,1.970000e+11,1970,0,0,Mexico,North America,NaN,Mexico city,NaN,NaN,1,0,0.0,0.0
2,1.970000e+11,1970,1,0,Philippines,Southeast Asia,Tarlac,Unknown,NaN,NaN,1,0,1.0,0.0
3,1.970000e+11,1970,1,0,Greece,Western Europe,Attica,Athens,NaN,NaN,1,0,NaN,NaN
4,1.970000e+11,1970,1,0,Japan,East Asia,NaN,Fukouka,NaN,NaN,1,0,NaN,NaN
5,1.970000e+11,1970,1,1,United States,North America,Illinois,Cairo,NaN,1/1/1970: Unknown African American assailants ...,1,0,0.0,0.0
6,1.970000e+11,1970,1,2,Uruguay,South America,Montevideo,Montevideo,NaN,NaN,0,0,0.0,0.0
7,1.970000e+11,1970,1,2,United States,North America,California,Oakland,Edes Substation,1/2/1970: Unknown perpetrators detonated explo...,1,0,0.0,0.0
8,1.970000e+11,1970,1,2,United States,North America,Wisconsin,Madison,NaN,"1/2/1970: Karl Armstrong, a member of the New ...",1,0,0.0,0.0
9,1.970000e+11,1970,1,3,United States,North America,Wisconsin,Madison,NaN,"1/3/1970: Karl Armstrong, a member of the New ...",1,0,0.0,0.0

In [18]:
df.dtypes #checking all the datatypes

eventid        float64
iyear            int64
imonth           int64
iday             int64
country_txt     object
region_txt      object
provstate       object
city            object
location        object
summary         object
success          int64
suicide          int64
nkill          float64
nwound         float64
dtype: object

**Q.1) How many attacks happened in India?**

In [225]:
Attacks_India=df[df['country_txt']=='India']
#Only accessing the countries which is equal to India

print(f"Total number of attacks in India is {Attacks_India.shape[0]}")

Total number of attacks in India is 9940

**Q.2) How many attacks happened in India and upto 3 people were killed?**

In [226]:
Q2_India_Attacks=df[(df['country_txt']=='India') & (df['nkill']<=3)]
#Acessing all rows in which country is India and kill count is atmost 3

print(f'Total number of attacks that happened in India where atmost 3 people were killed {Q2_India_Attacks.shape[0]}')

Total number of attacks that happened in India where atmost 3 people were killed 8362

**Q.3) Extract the city and summary for attacks above**

In [227]:
Summary=Q2_India_Attacks[["city","summary"]]
#Taking the dataframe from Q2 and only displaying city and summary column

print('Below is the summary of the attacks in India upto 3')
print(Summary)

Below is the summary of the attacks in India upto 3
              city                                            summary
1185     New Delhi                                                NaN
3780     New Delhi                                                NaN
5251        Bombay                                                NaN
7266        Imphal                                                NaN
8609       Unknown                                                NaN
...            ...                                                ...
156695       Terem  12/29/2015: Assailants abducted three students...
156698  Peravurani  12/29/2015: An explosive device was discovered...
156713   Tulsibari  12/29/2015: Assailants abducted Hazrat Ali in ...
156725     Zhutovi  12/30/2015: Assailants attempted to extort mon...
156756    Srinagar  12/31/2015: Assailants threw a grenade at an I...

[8362 rows x 2 columns]

**Q.4) In a single terror incident in India, find out top 5 cities by number killed**
Hint: Use each row as as a unique terror incident. Use country_txt, nkill and city
columns

In [308]:
Top_killed_cities=Attacks_India.sort_values(by="nkill",ascending=False)
#Acessing the dataframe from Q1 where it hold all attacks in India
#sorting it in descending order to get the top 5.

Top_killed_cities=Top_killed_cities[["country_txt","city","nkill"]]
#only considering the reqired columns

print(f'The data of top 5 cities killed by number are \n{Top_killed_cities.head(5)}')

Just_cities=Top_killed_cities.iloc[0:5,1].to_string(index=False)
#To only know the name of the cities without it's index, we have to convert it into a string with index value as False.

print('\033[1m'+ f"The top 5 cities are \n{Just_cities}")

The data of top 5 cities killed by number are
      country_txt                city  nkill
81000       India              Mumbai  188.0
96598       India             Jhargam  115.0
54339       India              Bombay  115.0
95860       India  Dantewada district   82.0
56837       India            Banabari   70.0
The top 5 cities are
            Mumbai
           Jhargam
            Bombay
Dantewada district
          Banabari

**Q.5) In a single terror incident in India, find out top 5 cities by number killed and
wounded**
Hint: Use each row as as a unique terror incident. Use country_txt, nkill,
nwound and city columns

In [322]:
df2=Attacks_India.copy()
#copying into a new data set as a new column is being added

df2["Killed_Wounded"]=Attacks_India["nkill"] + Attacks_India["nwound"]
#Adding a new column which is an addition of both kills and wounds to sort.

Top_kill_wound_cities=df2.sort_values(by="Killed_Wounded",ascending=False)
#Sorting in descending order.

Top_kill_wound_cities=Top_kill_wound_cities[["city","Killed_Wounded","nkill","nwound"]]
#displaying only the required data

print(f'The data of top 5 cities killed by number are \n{Top_kill_wound_cities.head(5)}')

Just_cities=Top_kill_wound_cities.iloc[0:5,0].to_string(index=False)
#To only know the name of the cities without it's index, we have to convert it into a string with index value as False.

print('\033[1m'+ f"The top 5 cities are \n{Just_cities}")

The data of top 5 cities killed by number are
            city  Killed_Wounded  nkill  nwound
81000     Mumbai          1005.0  188.0   817.0
89128     Dispur           272.0   37.0   235.0
96598    Jhargam           255.0  115.0   140.0
30378    Chennai           232.0   32.0   200.0
79045  New Delhi           210.0   55.0   155.0
The top 5 cities are
   Mumbai
   Dispur
  Jhargam
  Chennai
New Delhi

In [323]:
#Alternate understanding and solution for the above question, where nkill and nwound are not added. 

Top_kill_wound_cities=Attacks_India.sort_values(by=["nkill","nwound"],ascending=False)
Top_kill_wound_cities=Top_kill_wound_cities[["country_txt","city","nkill","nwound"]]
Top_kill_wound_cities.head()

      country_txt                city  nkill  nwound
81000       India              Mumbai  188.0   817.0
96598       India             Jhargam  115.0   140.0
54339       India              Bombay  115.0     0.0
95860       India  Dantewada district   82.0     0.0
56837       India            Banabari   70.0   100.0

**Q.6) How many attacks were successful that were suicide attacks?**
Hint: Use suicide and success columns

In [231]:
Succeful_suicide=df[(df['suicide']==1) & (df["success"]==1)]
# Attacks where success and suicide has occured which is 1.

print(f'The number of attacks that were successful and were also a suicide attacks {Succeful_suicide.shape[0]}')

The number of attacks that were successful and were also a suicide attacks 4260

**Q.7) Label all the incidents where the number killed was more than 5 as severe.**
Hint:
Use Aggregations and manipulations using apply and map
#map: map a function to each element of a series object
#Suppose we want to label all the incidents where the number killed was more
than 5 as severe. This would involve applying a function on each element of the
series, map helps in doing that.
#You can use lambda functions as well (if else follows a special form when used
with lambdas )
Use the nkill column.

In [232]:
df1=df.copy() #Copied into a new dataframe as i don't want to change the original one

df1['severity'] = df1['nkill'].map(lambda x: 'Severe' if (x>5) else 'Not Severe')
#adding a new column severity where kills more than 5 are considered severe, and less than 5 or 5 considered as not severe.

print("A new column called Severity is added to the dataframe showing if kills were severe if more than 5")
df1.head(10)

A new column called Severity is added to the dataframe showing if kills were severe if more than 5

,eventid,iyear,imonth,iday,country_txt,region_txt,provstate,city,location,summary,success,suicide,nkill,nwound,severity
0,1.970000e+11,1970,0,0,Dominican Republic,Central America & Caribbean,NaN,Santo Domingo,NaN,NaN,1,0,1.0,0.0,Not Severe
1,1.970000e+11,1970,0,0,Mexico,North America,NaN,Mexico city,NaN,NaN,1,0,0.0,0.0,Not Severe
2,1.970000e+11,1970,1,0,Philippines,Southeast Asia,Tarlac,Unknown,NaN,NaN,1,0,1.0,0.0,Not Severe
3,1.970000e+11,1970,1,0,Greece,Western Europe,Attica,Athens,NaN,NaN,1,0,NaN,NaN,Not Severe
4,1.970000e+11,1970,1,0,Japan,East Asia,NaN,Fukouka,NaN,NaN,1,0,NaN,NaN,Not Severe
5,1.970000e+11,1970,1,1,United States,North America,Illinois,Cairo,NaN,1/1/1970: Unknown African American assailants ...,1,0,0.0,0.0,Not Severe
6,1.970000e+11,1970,1,2,Uruguay,South America,Montevideo,Montevideo,NaN,NaN,0,0,0.0,0.0,Not Severe
7,1.970000e+11,1970,1,2,United States,North America,California,Oakland,Edes Substation,1/2/1970: Unknown perpetrators detonated explo...,1,0,0.0,0.0,Not Severe
8,1.970000e+11,1970,1,2,United States,North America,Wisconsin,Madison,NaN,"1/2/1970: Karl Armstrong, a member of the New ...",1,0,0.0,0.0,Not Severe
9,1.970000e+11,1970,1,3,United States,North America,Wisconsin,Madison,NaN,"1/3/1970: Karl Armstrong, a member of the New ...",1,0,0.0,0.0,Not Severe

**Q.8) write a function to label an incident that was both successful and suicidal.**
Hint: We can use apply to use a function column wise where you can use
columns success and suicide in the data

In [236]:
df1['Suicide and Success']=df1.apply(lambda x: 'Both occured' if ((x['success']==1) & (x['suicide']==1)) else 'Both did not occur',axis=1)
#Adding a new column "Suicide and Success where I have applied on the column(axis 1) when success and suicide is 1

df1.head()


#df2=df1[df1['Suicide and Success']=="Both occured"]
#df2.head() This was just to check the both occured records.

,eventid,iyear,imonth,iday,country_txt,region_txt,provstate,city,location,summary,success,suicide,nkill,nwound,severity,Suicide and Success
0,1.970000e+11,1970,0,0,Dominican Republic,Central America & Caribbean,NaN,Santo Domingo,NaN,NaN,1,0,1.0,0.0,Not Severe,Both did not occur
1,1.970000e+11,1970,0,0,Mexico,North America,NaN,Mexico city,NaN,NaN,1,0,0.0,0.0,Not Severe,Both did not occur
2,1.970000e+11,1970,1,0,Philippines,Southeast Asia,Tarlac,Unknown,NaN,NaN,1,0,1.0,0.0,Not Severe,Both did not occur
3,1.970000e+11,1970,1,0,Greece,Western Europe,Attica,Athens,NaN,NaN,1,0,NaN,NaN,Not Severe,Both did not occur
4,1.970000e+11,1970,1,0,Japan,East Asia,NaN,Fukouka,NaN,NaN,1,0,NaN,NaN,Not Severe,Both did not occur

**Q.9) Create a new category representing if the incident occured in Afghanistan,
Pakistan or India as one level of the category and all the other countries as
another level. Label all other countries as ROW and new column which contains
the new category as ‘Local’ in the data.**
Hint: Create a new category representing if the incident occured in Afghanistan,
Pakistan or India as one level of the category and all the other countries as
another level.
Use the columns – country_txt and create a new column called “Local” in the
dataset

In [237]:
df1["Local"]=df1["country_txt"].apply(lambda x: "LOCAL" if x in ["Afghanistan","India","Pakistan"] else "ROW")
#Adding a new column "Local" where if countries are Af-Pak-Ind they are LOCAL and Rest of the World is ROW . 

df1.head()

,eventid,iyear,imonth,iday,country_txt,region_txt,provstate,city,location,summary,success,suicide,nkill,nwound,severity,Suicide and Success,Local
0,1.970000e+11,1970,0,0,Dominican Republic,Central America & Caribbean,NaN,Santo Domingo,NaN,NaN,1,0,1.0,0.0,Not Severe,Both did not occur,ROW
1,1.970000e+11,1970,0,0,Mexico,North America,NaN,Mexico city,NaN,NaN,1,0,0.0,0.0,Not Severe,Both did not occur,ROW
2,1.970000e+11,1970,1,0,Philippines,Southeast Asia,Tarlac,Unknown,NaN,NaN,1,0,1.0,0.0,Not Severe,Both did not occur,ROW
3,1.970000e+11,1970,1,0,Greece,Western Europe,Attica,Athens,NaN,NaN,1,0,NaN,NaN,Not Severe,Both did not occur,ROW
4,1.970000e+11,1970,1,0,Japan,East Asia,NaN,Fukouka,NaN,NaN,1,0,NaN,NaN,Not Severe,Both did not occur,ROW

**Q.10) How many incidents happened in Af-Pak-India vs ROW?**
Hint: Use the newly created column “Local” and do a value_count or use the size
function

In [239]:
comparision=df1["Local"].value_counts()
#Counting the value of each unique row values(ie ROW and LOCAL) of column local.

print(f"Number of incidents between Af-Pak-Ind vs ROW \n{comparision}")

Number of incidents between Af-Pak-Ind vs ROW
ROW      124374
LOCAL     32398
Name: Local, dtype: int64

In [242]:
#Alternate solution printing each value seperately.

Al_Pak_Ind=df1[df1["Local"]=="LOCAL"].shape[0]
#getting the count of all LOCAL

Row=df1[df1["Local"]=="ROW"].shape[0]
#getting the count of all ROW

print(f"No of incidents happened in Al_Pak_Ind {Al_Pak_Ind} and Other places {Row}")

No of incidents happened in Al_Pak_Ind 32398 and Other places 124374

######                                END OF TERROR DATAFRAME QUESTIONS

### STACKOVERFLOW.CSV

In [336]:
sdf=pd.read_csv("stackoverflow.csv")

In [160]:
sdf.head()

,RespondentID,Country,Salary,YearsCodedJob,OpenSource,Hobby,CompanySizeNumber,Remote,CareerSatisfaction,Datascientist,...,DevOps,Embedded developer,Graphic designer,Graphics programming,Machine learning specialist,Mobile developer,Quality assurance engineer,Systems administrator,Web developer,
0,3,United Kingdom,113750.0,20,1,1,10000.0,Not remote,8,0,...,0,0,0,0,0,0,0,0,0,NaN
1,15,United Kingdom,100000.0,20,0,1,5000.0,Remote,8,0,...,0,1,0,0,0,0,0,0,0,NaN
2,18,United States,130000.0,20,1,1,1000.0,Remote,9,0,...,1,1,0,0,0,0,1,0,1,NaN
3,19,United States,82500.0,3,0,1,10000.0,Not remote,5,0,...,0,0,0,0,0,0,0,0,1,NaN
4,26,United States,175000.0,16,0,1,10000.0,Not remote,7,0,...,0,0,0,0,0,0,0,0,1,NaN

**1. How many rows and columns are present?**

In [283]:
rows_columns=sdf.shape
#Assigning to a new variable as i want to access each value separately.

print(f'No of rows and columns present is stackover flow data are {rows_columns}')

print(f'Where number of \033[1mrows is {sdf.shape[0]} and columns is {sdf.shape[1]}')

No of rows and columns present is stackover flow data are (6991, 23)
Where number of rows is 6991 and columns is 23

**2. How many missing values are present?**

In [352]:
sdf.drop(columns=sdf.columns[-1],axis=1,inplace=True)
#Removing the last unlabeled column as it has no data, when checked in excel.

Missing_values=sdf.isna().sum().sum()
#Using the method isna(ie is not available)and finding the sum of each columns. 
#Using another sum function to add all the column values.

print(f"The no of records in stackoverflow dataframe that has missing values is\033[1m {Missing_values} ")

The no of records in stackoverflow dataframe that has missing values is 31

**3. How many unique countries are in the dataframe stackoverflow.**

In [246]:
unique_countries_details=sdf['Country'].value_counts()
#Getting the details and name of all the different countries and how many records of them are present

print(f"Details of all the countries and the number od records present in each {unique_countries_details}")

unique_countries_count=sdf['Country'].nunique()
#Using nunique method to just get the count of all the unique countries present.

print('\033[1m' + f"Total number of countries are {unique_countries_count}")

Details of all the countries and the number od records present in each United States     3486
United Kingdom    1270
Germany            950
India              666
Canada             619
Name: Country, dtype: int64
Total number of countries are 5

**4. There are ________ Indian Data Scientists present in the data.**

In [281]:
Indian_DS=sdf[(sdf["Country"]=='India') & (sdf["Datascientist"]>0)].shape[0]

print(f"Total number of records where Data scientists are from India are\033[1m {Indian_DS}")

Total number of records where Data scientists are from India are 43

**5. ______ respondents work remotely in this data**

In [279]:
Remote_workers=sdf[sdf['Remote']=='Remote'].shape[0]

print(f"Total number of records who work remotely\033[1m {Remote_workers}")

Total number of records who work remotely 718

**6. _______ is the count of Germans who have more than 10 years of coding experience.**

In [280]:
Germans=sdf[(sdf['Country']=='Germany') & (sdf['YearsCodedJob']>10)]

print(f"No of Germans who have coding experience for more than 10 years is\033[1m {Germans.shape[0]}")

No of Germans who have coding experience for more than 10 years is 181

**7. Which Country has maximum average Salary?**

In [275]:
Avg_Sal=sdf.groupby("Country",as_index=False).agg({"Salary":'mean'}).sort_values(by="Country",ascending=False).head(1)

print(f"The country which has the highest average salary \033[1m {Avg_Sal.iloc[0,0]} and salary of {Avg_Sal.iloc[0,1]}")

The country which has the highest average salary  United States and salary of 98313.12765402869

**8. Country ________ has least remote workers**

In [278]:
Remote_workers=sdf[sdf.groupby("Country")['Remote'].apply(lambda x : x== "Remote")]

least=Remote_workers.groupby("Country",as_index=False)["Remote"].value_counts()

print(f"The country with least no. of remote workers are\033[1m {least.iloc[0,0]}")

The country with least no. of remote workers are Canada

**9. ____% is the percentage of Mobile Developers in the data**

In [350]:
#This method considers employees who work in more than 1 job. Ie there are few employees who work both in mob dev and web dev
Percentage=(sdf['Mobile developer'].sum() / sdf['Mobile developer'].shape[0]) * 100

Round_Percentage=Percentage.round(2)
#Rounding off

print(f"{Round_Percentage}% is the percentage of Mobile Developers in the data")

19.4% is the percentage of Mobile Developers in the data

In [351]:
#This method doesn't consider a person working in two different fields.

Total_employees=sdf.iloc[:,9:22].sum().sum()
#Getting the total number of employees in all different fields.That is why double sum function.

Percentage=(sdf['Mobile developer'].sum() / Total_employees) * 100
#calculating the percentage of mobile dev among all

Round_Percentage=Percentage.round(2)
#Rounding off

print(f"{Round_Percentage}% is the percentage of Mobile Developers in the data")

9.81% is the percentage of Mobile Developers in the data

**10. ____ is the number of profiles who are Mobile Developers and Web Developers and who work remotely?**

In [338]:
Mob_Dev=sdf[(sdf["Mobile developer"]==1) & (sdf["Web developer"]==1) & (sdf["Remote"]=='Remote')].shape[0]
print(f"{Mob_Dev} is the number of profiles who are Mobile Developers and Web Developers and who work remotely")

115 is the number of profiles who are Mobile Developers and Web Developers and who work remotely

In [349]:
#sdf1=sdf.copy()
#Mob_Dev=sdf1[["Mobile developer", "Web developer"]]
#Mob_Dev=sdf1[(sdf1["Mobile developer"]==1) & (sdf1["Web developer"]==1)]
#Mob_Dev
#sdf1